ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Documents/КоммерческоеПредложениеКлиенту/КоммерческоеПредложениеКлиенту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1b8b67c9-d102-4098-9ab2-841322b60f6e">
  <name>КоммерческоеПредложениеКлиенту</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="b596749b-e018-470f-817f-d9f00c5a20cc">
    <name>УдалитьДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a33d75a9-4c3d-41b2-a687-37eb78c263ac">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="ebd3ada4-6ba1-478b-b147-49ae1623f2b3">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="ed56e32a-75e7-4dff-8dc1-1cac24ac97a9">
      <name>КомментарийДляПокупателя</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>1000</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="46f97ce0-2c29-415d-89e7-c7750113ea4c">
      <name>КомментарийВнутренний</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>1000</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Documents/КоммерческоеПредложениеКлиенту/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
&После("ДобавитьКомандыПечати")
Процедура vs_ДобавитьКомандыПечати(КомандыПечати)
	// Коммерческое предложение
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.КоммерческоеПредложениеКлиенту";
	КомандаПечати.Идентификатор = "vs_ПФ_DOC_КоммерческоеПредложение_ru";
	КомандаПечати.Представление = НСтр("ru = 'Коммерческое предложение клиенту'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.ТребуетсяРасширениеРаботыСФайлами = Истина;
	ДополнительныеПараметры = Новый Структура;
	//ДополнительныеПараметры.Вставить("ОтображатьСкидки", Истина);
	КомандаПечати.ДополнительныеПараметры = ДополнительныеПараметры;
	КомандаПечати.Картинка = БиблиотекаКартинок.ФорматWord;
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать.
//  ПараметрыПечати - Структура - дополнительные настройки печати.
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы.
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект представление - имя области вывода.
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов.
//
&После("Печать")
Процедура vs_Печать(Знач МассивОбъектов, Знач ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "vs_ПФ_DOC_КоммерческоеПредложение_ru") Тогда
		
		ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "vs_ПФ_DOC_КоммерческоеПредложение_ru");
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"vs_ПФ_DOC_КоммерческоеПредложение_ru",
			НСтр("ru = 'Коммерческое предложение клиенту'"),
			vs_ПечатнаяФормаКоммерческоеПредложениеКлиенту_Word(МассивОбъектов, ОбъектыПечати, ПараметрыПечати, ПечатнаяФорма));
		
	КонецЕсли;
	
КонецПроцедуры 

Функция vs_ПечатнаяФормаКоммерческоеПредложениеКлиенту_Word(МассивОбъектов, ОбъектыПечати, ПараметрыПечати, ПечатнаяФорма)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	//
		
	//ПараметрыПечати = Неопределено;	
	
	//ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "vs_ПФ_DOC_КоммерческоеПредложение_ru");
	//Если ПечатнаяФорма <> Неопределено Тогда 
	
			
	ДанныеДляПечати = ДанныеДляПечати(МассивОбъектов, ПараметрыПечати);
	
	ДанныеШапки   = ДанныеДляПечати.РезультатПоШапке.Выбрать();  // ВыборкаИзРезультатаЗапроса
	ТаблицаТовары = ДанныеДляПечати.РезультатПоТоварам.Выгрузить(); // ТаблицаЗначений
	
	ТаблицаТоварыДокумента = Новый ТаблицаЗначений;
	Для Каждого КолонкаТаблицыЗначений Из ТаблицаТовары.Колонки Цикл
		ТаблицаТоварыДокумента.Колонки.Добавить(КолонкаТаблицыЗначений.Имя, КолонкаТаблицыЗначений.ТипЗначения);
	КонецЦикла;
	
    Т="ВЫБРАТЬ
      |	ЗадачаИсполнителя.Предмет КАК Предмет,
      |	ЗадачаИсполнителя.Ссылка КАК Задача,
      |	МАКСИМУМ(ЗадачаИсполнителя.Выполнена) КАК Выполнена
      |ИЗ
      |	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
      |ГДЕ
      |	ЗадачаИсполнителя.Предмет В(&Предметы)
      |
      |СГРУППИРОВАТЬ ПО
      |	ЗадачаИсполнителя.Предмет,
      |	ЗадачаИсполнителя.Ссылка
      |
      |УПОРЯДОЧИТЬ ПО
      |	Предмет,
      |	Задача
      |АВТОУПОРЯДОЧИВАНИЕ"; 
	
	Т="
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КПК.Ссылка КАК Ссылка,
	|	КПК.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКоммерческихПредложенийКлиентам.Действует) КАК Действует
	|ПОМЕСТИТЬ втКПК
	|ИЗ
	|	Документ.КоммерческоеПредложениеКлиенту КАК КПК
	|ГДЕ
	|	КПК.Ссылка В(&Предметы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втКПК.Ссылка 								КАК Ссылка,
	|	втКПК.Действует 							КАК Действует,
	|	КПК.БизнесПроцесс 							КАК БизнесПроцесс,
	|	КПК.Исполнитель 							КАК Исполнитель,
	|	КПК.Проверяющий 							КАК Проверяющий,
	|	МАКСИМУМ(ЕСТЬNULL(КПК.Выполнено, ЛОЖЬ)) 	КАК Выполнено,
	|	МАКСИМУМ(ЕСТЬNULL(КПК.НаПроверке, ЛОЖЬ)) 	КАК НаПроверке,
	|	МАКСИМУМ(ЕСТЬNULL(КПК.Подтверждено, ЛОЖЬ)) 	КАК Подтверждено
	|ИЗ
	|	втКПК КАК втКПК
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			КоммерческоеПредложениеКлиенту.Ссылка КАК Ссылка,
	|			Задание.Ссылка КАК БизнесПроцесс,
	|			Задание.Исполнитель КАК Исполнитель,
	|			МАКСИМУМ(ЕСТЬNULL(Задание.Выполнено, ЛОЖЬ)) КАК Выполнено,
	|			Задание.Проверяющий КАК Проверяющий,
	|			МАКСИМУМ(ЕСТЬNULL(Задание.НаПроверке, ЛОЖЬ)) КАК НаПроверке,
	|			МАКСИМУМ(ЕСТЬNULL(Задание.Подтверждено, ЛОЖЬ)) КАК Подтверждено
	|		ИЗ
	|			втКПК КАК КоммерческоеПредложениеКлиенту
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ БизнесПроцесс.Задание КАК Задание
	|				ПО КоммерческоеПредложениеКлиенту.Ссылка = Задание.Предмет
	|					И (ЕСТЬNULL(Задание.Выполнено, ЛОЖЬ) = ИСТИНА
	|						ИЛИ ЕСТЬNULL(Задание.Подтверждено, ЛОЖЬ) = ИСТИНА)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			КоммерческоеПредложениеКлиенту.Ссылка,
	|			Задание.Ссылка,
	|			Задание.Исполнитель,
	|			Задание.Проверяющий
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			КоммерческоеПредложениеКлиенту.Ссылка,
	|			Задание.Ссылка,
	|			Задание.Автор,
	|			МАКСИМУМ(ЕСТЬNULL(Задание.РезультатСогласования = ЗНАЧЕНИЕ(Перечисление.РезультатыСогласования.Согласовано), ЛОЖЬ)),
	|			Задание.Автор,
	|			МИНИМУМ(НЕ ЕСТЬNULL(Задание.РезультатСогласования = ЗНАЧЕНИЕ(Перечисление.РезультатыСогласования.Согласовано), ЛОЖЬ)),
	|			МАКСИМУМ(ЕСТЬNULL(Задание.РезультатСогласования = ЗНАЧЕНИЕ(Перечисление.РезультатыСогласования.Согласовано), ЛОЖЬ))
	|		ИЗ
	|			втКПК КАК КоммерческоеПредложениеКлиенту
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ БизнесПроцесс.СогласованиеПродажи КАК Задание
	|				ПО КоммерческоеПредложениеКлиенту.Ссылка = Задание.Предмет
	|					И (Задание.РезультатСогласования = ЗНАЧЕНИЕ(Перечисление.РезультатыСогласования.Согласовано) = ИСТИНА)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			КоммерческоеПредложениеКлиенту.Ссылка,
	|			Задание.Ссылка,
	|			Задание.Автор,
	|			Задание.Автор) КАК КПК
	|		ПО втКПК.Ссылка = КПК.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	втКПК.Ссылка,
	|	КПК.БизнесПроцесс,
	|	КПК.Исполнитель,
	|	КПК.Проверяющий,
	|	втКПК.Действует
	|
	|УПОРЯДОЧИТЬ ПО
	|	втКПК.Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ";

	Запрос = Новый Запрос(Т);
	Запрос.УстановитьПараметр("Предметы",МассивОбъектов);
	РезультатВыполненияЗадач = Запрос.Выполнить();
	
	ОфисныеДокументы = Новый Соответствие;
	
	//Если не РезультатВыполненияЗадач.Пустой() Тогда
	ВыборкаРеультатаВыполненяЗадач = РезультатВыполненияЗадач.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	
	Шаблон = НСтр("ru = 'Коммерческое предложение клиенту [Организация] (№[Номер] от [Дата])'");
	//	
	ПервыйДокумент = Истина;
	
	Пока ДанныеШапки.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("Ссылка", ДанныеШапки.Ссылка);
		
		ЗаписьНайдена = ВыборкаРеультатаВыполненяЗадач.НайтиСледующий(ПараметрыПоиска);
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ЗаписьНайдена);
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТипЗнч(ЗаписьНайдена)); 
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Тип("Булево"));
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТипЗнч(ЗаписьНайдена) = Тип("Булево"));
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("_________________________________________________________");
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ВыборкаРеультатаВыполненяЗадач.Выполнено);
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ВыборкаРеультатаВыполненяЗадач.Подтверждено);
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ВыборкаРеультатаВыполненяЗадач.Действует);
		Если ТипЗнч(ЗаписьНайдена) = Тип("Булево")
			и ЗаписьНайдена 
			и ВыборкаРеультатаВыполненяЗадач.Выполнено 
			и ВыборкаРеультатаВыполненяЗадач.Подтверждено
			и ВыборкаРеультатаВыполненяЗадач.Действует Тогда
			ИмяМакета = "vs_ПФ_DOC_КоммерческоеПредложениеСПодписью_ru";
			МакетИДанныеОбъекта = МакетыИДанныеОбъектовДляПечати("Документ.КоммерческоеПредложениеКлиенту", ИмяМакета, МассивОбъектов, ДанныеШапки, ТаблицаТовары);
		Иначе
			ИмяМакета = "vs_ПФ_DOC_КоммерческоеПредложение_ru";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("%1 %2 и %3",ДанныеШапки.Ссылка,?(ВыборкаРеультатаВыполненяЗадач.Выполнено, "Выполнено", "НЕ выполнено!"), ?(ВыборкаРеультатаВыполненяЗадач.Подтверждено, "Подтверждено", "НЕ подтверждено!")));
			МакетИДанныеОбъекта = МакетыИДанныеОбъектовДляПечати("Документ.КоммерческоеПредложениеКлиенту", ИмяМакета, МассивОбъектов, ДанныеШапки, ТаблицаТовары);
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ТаблицаТоварыДокумента.Очистить();
		
		НайденныеСтроки = ТаблицаТовары.НайтиСтроки(ПараметрыПоиска);
		
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НоваяСтрока = ТаблицаТоварыДокумента.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденнаяСтрока);
		КонецЦикла; 
		
		ЗначенияРеквизитов = Новый Соответствие;
		ЗначенияРеквизитов.Вставить("Организация",ДанныеШапки.Организация);
		ЗначенияРеквизитов.Вставить("Номер",      ДанныеШапки.Номер);
		ЗначенияРеквизитов.Вставить("Дата",       Формат(ДанныеШапки.Дата,"ДЛФ=ДД"));
		ИмяДокумента = СтроковыеФункции.СтрокаЛатиницей(СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблон, ЗначенияРеквизитов));
		
		//ДанныеОбъекта = ДанныеОбъектаПоДаннымДляПечати(ДанныеШапки, ТаблицаТоварыДокумента);
		АдресХранилищаОфисныйДокумент = vs_ЗаполнитьТабличныйДокументКоммерческоеПредложениеКлиенту(НоваяСтрока.Ссылка, МакетИДанныеОбъекта, ИмяМакета);
		
		//УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеШапки.Ссылка);
		ОфисныеДокументы.Вставить(АдресХранилищаОфисныйДокумент, ИмяДокумента);
	КонецЦикла;
	//КонецЕсли;
	
	ПечатнаяФорма.СинонимМакета    = НСтр("ru = 'Коммерческое предложение клиенту (Microsoft Word)'");
	ПечатнаяФорма.ОфисныеДокументы = ОфисныеДокументы;
	ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;   // fix Suetin 18.10.2019 14:02:00
		
	//КонецЕсли;
	Возврат ПечатнаяФорма;
	
КонецФункции

Функция ПолучитьДанныеПечати(Знач Согласия, Знач МассивИменМакетов, Знач ДанныеШапки, Знач ТаблицаТовары) Экспорт
	
	ДанныеПоВсемОбъектам = Новый Соответствие;
	
	СоответствиеПоСогласиям = СоответствиеДанныхДляПечатиСогласий(Согласия, ДанныеШапки, ТаблицаТовары);
	
	Для Каждого ОбъектСсылка Из Согласия Цикл
		ДанныеОбъектаПоМакетам = Новый Соответствие;
		Для Каждого ИмяМакета Из МассивИменМакетов Цикл
			ДанныеОбъектаПоМакетам.Вставить(ИмяМакета, СоответствиеПоСогласиям[ОбъектСсылка]);
		КонецЦикла;
		ДанныеПоВсемОбъектам.Вставить(ОбъектСсылка, ДанныеОбъектаПоМакетам);
	КонецЦикла;
	
	ОписаниеОбластей = Новый Соответствие;
	ДвоичныеДанныеМакетов = Новый Соответствие;
	
	Для Каждого ИмяМакета Из МассивИменМакетов Цикл
		//Если ИмяМакета = "vs_ПФ_DOC_КоммерческоеПредложение_ru" Тогда
		//	ДвоичныеДанныеМакетов.Вставить(ИмяМакета, Документы.КоммерческоеПредложениеКлиенту.ПолучитьМакет("vs_ПФ_DOC_КоммерческоеПредложение_ru"));
		//ИначеЕсли ИмяМакета = "vs_ПФ_DOC_КоммерческоеПредложениеСПодписью_ru" Тогда
		//	ДвоичныеДанныеМакетов.Вставить(ИмяМакета, Документы.КоммерческоеПредложениеКлиенту.ПолучитьМакет("vs_ПФ_DOC_КоммерческоеПредложениеСПодписью_ru"));
		//КонецЕсли;
		ДвоичныеДанныеМакетов.Вставить(ИмяМакета, Документы.КоммерческоеПредложениеКлиенту.ПолучитьМакет(ИмяМакета));
		ОписаниеОбластей.Вставить(ИмяМакета, ОписаниеОбластейМакетаОфисногоДокумента());
	КонецЦикла;
	
	Макеты = Новый Структура("ОписаниеОбластей, ДвоичныеДанныеМакетов");
	Макеты.ОписаниеОбластей = ОписаниеОбластей;
	Макеты.ДвоичныеДанныеМакетов = ДвоичныеДанныеМакетов;
	
	ДанныеПечати = Новый Структура("Данные, Макеты");
	ДанныеПечати.Данные = ДанныеПоВсемОбъектам;
	ДанныеПечати.Макеты = Макеты;
	
	Возврат ДанныеПечати;
	
КонецФункции

Функция ДанныеДляПечатиСогласий(Согласия, ДанныеШапки, ТаблицаТовары)
	
	ДанныеДляПечати = Новый Массив;
	
	Описание = ОписаниеСогласия();
	ЗаполнитьЗначенияСвойств(Описание, ДанныеШапки);
	Описание.Сделка_НомерДата = СтрШаблон("%1 от %2",ДанныеШапки.Номер,Формат(ДанныеШапки.Дата,"ДЛФ=ДД")); 
	Описание.СрокДействия = СтрШаблон("%1 календарных дней", Цел((НачалоДня(ДанныеШапки.СрокДействия) - НачалоДня(ДанныеШапки.Дата)) / 60 / 60 / 24));
	Описание.КП_ТЗ = ТаблицаТовары;
	Описание.Подписант = "Иванов Владимир Адольфович";
	//РФ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеШапки.Менеджер.ФизическоеЛицо, 
	//	"ФИО, Фамилия,Имя,Отчество,Инициалы, АдресЭлектроннойПочты, Телефон", 
	//	Истина);
	Струк = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеШапки.Менеджер,"ФизическоеЛицо");
	Сведения = Новый Структура("
	|Ссылка,
	|ДатаРождения,
	|ИНН,
	|МестоРождения,
	|Пол,
	|СтраховойНомерПФР,
	|ФИО,
	|Фамилия,
	|Имя,
	|Отчество,
	|Гражданство,
	|АдресМестаПроживанияXML,
	|АдресМестаПроживания,
	|АдресПоПропискеXML,
	|АдресПоПрописке,
	|ТелефоныXML,
	|Телефоны,
	|ЭлектроннаяПочта");
	ЭлектронноеВзаимодействиеУТ.ПолучитьДанныеФизЛица(Струк.ФизическоеЛицо, Сведения, Ложь); 
	ПараметрыСклонения = СклонениеПредставленийОбъектовКлиентСервер.ПараметрыСклонения();
	ПараметрыСклонения.ЭтоФИО = Истина;
	ПараметрыСклонения.Пол = ?(Сведения.Пол = "Мужской",1,2);
	ФИОВПадеже = СклонениеПредставленийОбъектов.ДанныеСклонения(Сведения.ФИО, ПараметрыСклонения);

	Описание.Менеджер =   СтрШаблон("%1
									|тел: %2
									|eml: %3",ФИОВПадеже.Родительный, Сведения.Телефоны, Сведения.ЭлектроннаяПочта);
	ДанныеДляПечати.Добавить(Описание); 
	
	Возврат ДанныеДляПечати;
КонецФункции

Функция МакетыИДанныеОбъектовДляПечати(Знач ИмяМенеджераПечати, Знач ИменаМакетов, Знач СоставДокументов, Знач ДанныеШапки, Знач ТаблицаТовары) Экспорт
	
	МассивИменМакетов = СтрРазделить(ИменаМакетов, ", ", Ложь);
	
	МакетыИДанные = ПолучитьДанныеПечати(СоставДокументов, МассивИменМакетов, ДанныеШапки, ТаблицаТовары);
	МакетыИДанные.Вставить("ЛокальныйКаталогФайловПечати", Неопределено); // Для обратной совместимости.
	
	Если НЕ МакетыИДанные.Макеты.Свойство("ТипыМакетов") Тогда
		МакетыИДанные.Макеты.Вставить("ТипыМакетов", Новый Соответствие); // Для обратной совместимости.
	КонецЕсли;
	
	Возврат МакетыИДанные;
	
КонецФункции

Функция vs_ЗаполнитьТабличныйДокументКоммерческоеПредложениеКлиенту(ДокументСсылка, МакетИДанныеОбъекта, ИмяМакета)
	
	ТипМакета				= МакетИДанныеОбъекта.Макеты.ТипыМакетов[ИмяМакета];
	ДвоичныеДанныеМакетов	= МакетИДанныеОбъекта.Макеты.ДвоичныеДанныеМакетов;
	Области					= МакетИДанныеОбъекта.Макеты.ОписаниеОбластей;
	ДанныеОбъекта			= МакетИДанныеОбъекта.Данные[ДокументСсылка][ИмяМакета];
	
	Макет = УправлениеПечатью.ИнициализироватьМакетОфисногоДокумента(ДвоичныеДанныеМакетов[ИмяМакета], ТипМакета, ИмяМакета);
	Если Макет = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ЗакрытьОкноПечатнойФормы = Ложь;
	Попытка
		ПечатнаяФорма = УправлениеПечатью.ИнициализироватьПечатнуюФорму(ТипМакета, Макет.НастройкиСтраницыМакета, Макет);
		АдресХранилищаПечатнойФормы = "";
		Если ПечатнаяФорма = Неопределено Тогда
			УправлениеПечатью.ОчиститьСсылки(Макет);
			Возврат "";
		КонецЕсли;
		
		// Вывод обычных областей с параметрами.
		
		Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["РеквизитыСубъекта"]);
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
		
		Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["Заголовок"]);
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
		
		//Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["НомерДата"]);
		//УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
		
		Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["ШапкаТаблицы"]);  //  Преамбула
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
		
		Для Каждого СтрТЗ Из ДанныеОбъекта.КП_ТЗ Цикл
			ЗаполнитьЗначенияСвойств(ДанныеОбъекта, СтрТЗ);
			ДанныеОбъекта.Количество = Формат(ДанныеОбъекта.Количество, "ЧДЦ=3");
			ДанныеОбъекта.СуммаСНДС = Формат(ДанныеОбъекта.СуммаСНДС, "ЧДЦ=2");
			Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["СтрокаТаблицы"]);  //  Преамбула
			УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
		КонецЦикла;
		
		ДанныеОбъекта.СуммаСНДСИтогоПрописью = 
			РаботаСКурсамиВалютУТ.СформироватьСуммуПрописью(ДанныеОбъекта.КП_ТЗ.Итог("СуммаСНДС"), ДанныеОбъекта.Валюта, Ложь);
			
		ДанныеОбъекта.СуммаСНДСИТОГО = Формат(ДанныеОбъекта.КП_ТЗ.Итог("СуммаСНДС"),"ЧДЦ=2");
		Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["ИтогоТаблицы"]);  //  Преамбула
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
		
		
		//Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["ОсновнойТекст"]);
		//УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
		
		Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["РеквизитыОператора"]);
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
		
		//Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["Подпись"]);
		//УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
					
		АдресХранилищаПечатнойФормы = УправлениеПечатью.СформироватьДокумент(ПечатнаяФорма);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗакрытьОкноПечатнойФормы = Истина;
		Возврат "";
	КонецПопытки;
	
	УправлениеПечатью.ОчиститьСсылки(ПечатнаяФорма, ЗакрытьОкноПечатнойФормы);
	УправлениеПечатью.ОчиститьСсылки(Макет);
	
	Возврат АдресХранилищаПечатнойФормы;
	
КонецФункции

// Структура данных для подготовки печатных форм.
//
// Параметры:
//	Согласия - массив документов типа ДокументСсылка.СогласиеНаОбработкуПерсональныхДанных.
//
// Возвращаемое значение - соответствие, в котором ключом является ссылкой, а значением описание, см. ОписаниеСогласия().
//
Функция СоответствиеДанныхДляПечатиСогласий(Согласия, ДанныеШапки, ТаблицаТовары)
	
	Соответствие = Новый Соответствие;
	
	ДанныеДляПечати = ДанныеДляПечатиСогласий(Согласия, ДанныеШапки, ТаблицаТовары);
	
	Для Каждого ОписаниеСогласия Из ДанныеДляПечати Цикл
		Соответствие.Вставить(ОписаниеСогласия.Ссылка, ОписаниеСогласия);
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

Функция ОписаниеОбластейМакетаОфисногоДокумента()
	
	ОписаниеОбластей = Новый Структура;
	
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Заголовок",			"Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "НомерДата",			"Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Преамбула",			"Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ШапкаТаблицы",		    "Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "СтрокаТаблицы",	    "Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ИтогоТаблицы",	        "Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ОсновнойТекст",		"Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "РеквизитыОператора",	"Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "РеквизитыСубъекта",	"Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Подпись",				"Общая");
	
	Возврат ОписаниеОбластей;
	
КонецФункции

Функция ОписаниеСогласия()
	
	ОписаниеСогласия = Новый Структура(
		"Сделка,
		|Ссылка,
		|Менеджер, 
		|Организация, 
		|Сделка_НомерДата, 
		|НОМЕНКЛАТУРА, 
		|ПрочиеУсловияПоставки, 
		|УсловияДоставки,
		|КомментарийДляПокупателя,
		|НомерСтроки,  
		|КОЛИЧЕСТВО,
		|ЕдиницаИзмерения, 
		|СуммаСНДС,
		|СуммаСНДСИТОГО,
		|Валюта,
		|СуммаСНДСИтогоПрописью,
		|УсловияОплаты, 
		|СрокДействия,
		|Подписант,
		|КП_ТЗ");
		
	//ОписаниеСогласия.ДатаСогласия = НСтр("ru = '«____»_______________20___г.';
	//									|en = '/ /20'");
	//ОписаниеСогласия.Организация = НСтр("ru = '<Организация>';
	//									|en = '<Company>'");
	//ОписаниеСогласия.ОрганизацияВДательномПадеже = ОписаниеСогласия.Организация;
	//ОписаниеСогласия.АдресОрганизации = НСтр("ru = '<Адрес организации>';
	//										|en = '<Company address>'");
	//ОписаниеСогласия.ОтветственныйЗаОбработкуПерсональныхДанных = НСтр("ru = '<ФИО ответственного лица>';
	//																	|en = '<Full name of responsible person>'");
	//ОписаниеСогласия.ОтветственныйЗаОбработкуПерсональныхДанныхВРодительномПадеже = ОписаниеСогласия.ОтветственныйЗаОбработкуПерсональныхДанных;

	Возврат ОписаниеСогласия;
	
КонецФункции

&ИзменениеИКонтроль("ДанныеДляПечати")
Функция vs_ДанныеДляПечати(МассивОбъектов, ПараметрыПечати)

	СтруктураДанныхДляПечати = Неопределено;
	СтандартнаяОбработка = Истина;
	КоммерческиеПредложенияДокументыПереопределяемый.КоммерческоеПредложениеКлиентуПриФормированииСтруктурыДанныхПечати(
	МассивОбъектов,
	СтруктураДанныхДляПечати,
	ПараметрыПечати,
	СтандартнаяОбработка);

	Если Не СтандартнаяОбработка Тогда
		Возврат СтруктураДанныхДляПечати;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);

	ОтображатьСкидки = Истина;
	Если ПараметрыПечати.Свойство("ОтображатьСкидки")
		И Не ПараметрыПечати.ОтображатьСкидки Тогда
		ОтображатьСкидки = Ложь;
	КонецЕсли;

	Запрос.УстановитьПараметр("ОтображатьСкидки", ОтображатьСкидки);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	КоммерческоеПредложениеКлиенту.Ссылка                              КАК Ссылка,
	|	КоммерческоеПредложениеКлиенту.Дата                                КАК Дата,
	|	КоммерческоеПредложениеКлиенту.Номер                               КАК Номер,
	|	КоммерческоеПредложениеКлиенту.Менеджер                            КАК Менеджер,
	|	КоммерческоеПредложениеКлиенту.КонтактноеЛицо                      КАК КонтактноеЛицо,
	|	КоммерческоеПредложениеКлиенту.Организация                         КАК Организация,
	|	КоммерческоеПредложениеКлиенту.СрокДействия                        КАК СрокДействия,
	|	КоммерческоеПредложениеКлиенту.Валюта                              КАК Валюта,
	|	КоммерческоеПредложениеКлиенту.ЦенаВключаетНДС                     КАК ЦенаВключаетНДС,
	|	КоммерческоеПредложениеКлиенту.Налогообложение                     КАК УчитыватьНДС,
	|	КоммерческоеПредложениеКлиенту.УсловияДоставкиТекст                КАК УсловияДоставки,
	|	КоммерческоеПредложениеКлиенту.УсловияОплатыТекст                  КАК УсловияОплаты,
	|	КоммерческоеПредложениеКлиенту.ПрочаяДополнительнаяИнформацияТекст КАК ПрочиеУсловия,
	|	КоммерческоеПредложениеКлиенту.Клиент                              КАК Клиент,
	|	КоммерческоеПредложениеКлиенту.Контрагент                          КАК Контрагент,
	|	КоммерческоеПредложениеКлиенту.ВариантУказанияСрокаПоставки        КАК ВариантУказанияСрокаПоставки,
#Вставка
	|	КоммерческоеПредложениеКлиенту.Сделка                              КАК Сделка,
#КонецВставки
	|	КоммерческоеПредложениеКлиенту.МожетВыкупатьсяЧастично             КАК МожетВыкупатьсяЧастично
	|ИЗ
	|	Документ.КоммерческоеПредложениеКлиенту КАК КоммерческоеПредложениеКлиенту
	|ГДЕ
	|	КоммерческоеПредложениеКлиенту.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Ссылка                                                   КАК Ссылка,
	|	Товары.НомерСтроки                                              КАК НомерСтроки,
#Удаление	
	|	Товары.Номенклатура                                             КАК Номенклатура,
	|	Товары.Характеристика                                           КАК Характеристика,
#КонецУдаления
#Вставка
	|	Ном.НаименованиеПолное                                          КАК Номенклатура,
	|	Товары.Характеристика                                           КАК Характеристика,
#КонецВставки
	|	Товары.СуммаРучнойСкидки + Товары.СуммаАвтоматическойСкидки     КАК СуммаСкидки,
	|	Товары.ПроцентРучнойСкидки + Товары.ПроцентАвтоматическойСкидки КАК ПроцентСкидки,
	|	&УсловияЕдиницыИзмерения                                        КАК ЕдиницаИзмерения,
	|	Товары.Количество                                               КАК Количество,
	|ВЫБОР
	|	КОГДА &ОтображатьСкидки
	|		ТОГДА Товары.Цена
	|	ИНАЧЕ ВЫБОР
	|			КОГДА Товары.Количество = 0
	|				ТОГДА 0
	|			ИНАЧЕ Товары.Сумма / Товары.Количество
	|		КОНЕЦ
	|КОНЕЦ                                                              КАК Цена,
	|	Товары.СуммаСНДС                                                КАК СуммаСНДС,
	|	Товары.Сумма                                                    КАК Сумма,
	|	Товары.СуммаНДС                                                 КАК СуммаНДС,
#Вставка
	|	Товары.КомментарийДляПокупателя                                 КАК КомментарийДляПокупателя,
	|	Товары.КомментарийВнутренний                                    КАК КомментарийВнутренний,
#КонецВставки
	|	Товары.СрокПоставки                                             КАК СрокПоставки
	|ИЗ
	|	Документ.КоммерческоеПредложениеКлиенту.Товары КАК Товары
#Вставка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|	ПО Товары.Номенклатура = Ном.ссылка
#КонецВставки
	|ГДЕ
	|	Товары.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки";

	УсловияЕдиницыИзмерения = "Товары.ЕдиницаИзмерения";
	КоммерческиеПредложенияДокументыПереопределяемый.ПолучитьТекстЗапросаПолученияЕдиницыИзмерения(УсловияЕдиницыИзмерения);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловияЕдиницыИзмерения", УсловияЕдиницыИзмерения);

	ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет(); // Массив из ВыборкаИзРезультатаЗапроса

	СтруктураДанныхДляПечати = Новый Структура;
	СтруктураДанныхДляПечати.Вставить("РезультатПоШапке",   ПакетРезультатовЗапроса[0]);
	СтруктураДанныхДляПечати.Вставить("РезультатПоТоварам", ПакетРезультатовЗапроса[1]);

	Возврат СтруктураДанныхДляПечати;

КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
